Dotfiles/emacs.d/init.org
#+title: GNU Emacs Configuration
#+property: header-args :tangle "init.el"
#+options: ':t toc:nil num:t author:nil
#+startup: content indent
#+macro: last-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last exported on {{{last-export-date}}} with a word count of {{{word-count}}}*

This is my literate Emacs configuration file.

Generate the configuration files with:
M-x org-babel-tangle

And then run the script located at ~/src/dotfiles/sync-dotfiles.sh

* Early init
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; lsp-mode performance optimization
  ;; see https://emacs-lsp.github.io/lsp-mode/page/performance/#use-plists-for-deserialization
  (setenv "LSP_USE_PLISTS" "true")
#+end_src

* Initial Setup

TODO (when (< emacs-major-version 30)
Do something to crash and don't start emacs?


#+begin_src emacs-lisp
  ;; Do not manually edit this file, if you need to make changes it is generated
  ;; from a org-bablel literate configuration available here:
  ;; https://github.com/wtfleming/dotfiles/blob/master/Dotfiles/emacs.d/init.org

  ;; Write any customized variables to a specific file instead of this file
  (setopt custom-file "~/.emacs.d/my-customized.el")
  (load custom-file)

  ;; Turn off mouse interface early in startup to avoid momentary display
                                          ;(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))


  ;; Load files from "~/.emacs.d/custom"
  (add-to-list 'load-path (expand-file-name "custom" user-emacs-directory))
  ;; (load "00-functions.el")
  ;; (load "01-common-setup.el")
  ;; (load "02-org-mode.el")
  ;; (load "03-macos.el")
  ;; (load "04-ibuffer.el")
  ;; (load "05-helm.el")
  ;; (load "06-hydra.el")
  ;; (load "07-doom-modeline.el")
  ;; (load "08-programming.el")
  ;; (load "09-gptel.el")
  ;; (load "10-transient.el")

  (when (file-exists-p "~/.emacs.d/lisp/rama-mode.el")
    (load "~/.emacs.d/lisp/rama-mode.el"))

#+end_src

* Functions
#+begin_src emacs-lisp
  ;;; Functions

  ;; Get current system type
  (defun insert-system-type()
    (interactive)
    "Get current system type"
    (insert (format "%s" system-type)))

  ;; Check if system is Darwin/Mac OS X
  (defun system-type-is-darwin ()
    (interactive)
    "Return true if system is darwin-based (Mac OS X)"
    (string-equal system-type "darwin"))

  ;; Check if system is GNU/Linux
  (defun system-type-is-gnu ()
    (interactive)
    "Return true if system is GNU/Linux-based"
    (string-equal system-type "gnu/linux"))


  (defun google ()
    "Google the selected region if any, display a query prompt otherwise."
    (interactive)
    (browse-url
     (concat
      "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
      (url-hexify-string (if mark-active
                             (buffer-substring (region-beginning) (region-end))
                           (read-string "Google: "))))))

  (defun wtf-googlemaps-lat-lon ()
    "Open in google maps the selected region if any, otherwise display a query prompt. Expects lat/lon pair to be whitespace separated"
    (interactive)
    (let* ((lat-lon-string (url-hexify-string (if mark-active
                                                  (buffer-substring (region-beginning) (region-end))
                                                (read-string "Googlemaps lat/lon: "))))
           (lat-lon-list (split-string lat-lon-string))
           (lat (nth 0 lat-lon-list))
           (lon (nth 1 lat-lon-list))
           (url-params (concat lat "%2C" lon)))
      (browse-url
       (concat "http://maps.google.com/?q=" lat))))


  (defun sort-words (reverse beg end)
    "Sort words in region alphabetically, in REVERSE if negative.
      Prefixed with negative \\[universal-argument], sorts in reverse.

      The variable `sort-fold-case' determines whether alphabetic case
      affects the sort order.

      See `sort-regexp-fields'."
    (interactive "*P\nr")
    (sort-regexp-fields reverse "[a-zA-Z0-9_\-]+" "\\&" beg end))

  ;; ------- misc -------
  (defun wtf-url-decode-region (start end)
    "Replace a region with the same contents, only URL decoded."
    (interactive "r")
    (let ((text (url-unhex-string (buffer-substring start end))))
      (delete-region start end)
      (insert text)))

  (defun wtf-url-encode-region (start end)
    "Replace a region with the same contents, only URL encoded."
    (interactive "r")
    (let ((text (url-hexify-string (buffer-substring start end))))
      (delete-region start end)
      (insert text)))

  (defun wtf-display-utc-time ()
    "Display the current UTC time in the minibuffer."
    (interactive)
    (let ((utc-time (format-time-string "%Y-%m-%d %H:%M:%S" (current-time) t)))
      (message "Current UTC time: %s" utc-time)))
#+end_src


